waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_spi.h
/**
  * @brief    Get SPI TX Buffer Empty Flag
  * @rmtoll   ISR    TXBE    FL_SPI_IsActiveFlag_TXBuffEmpty
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_TXBuffEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_TXBE_Msk) == (SPI_ISR_TXBE_Msk));
}

/**
  * @brief    Get I2S TX Buffer Empty Flag
  * @rmtoll   ISR    TXBE    FL_I2S_IsActiveFlag_TXBuffEmpty
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_TXBuffEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_TXBE_Msk) == (SPI_ISR_TXBE_Msk));
}

/**
  * @brief    Get SPI RX Buffer Full Flag
  * @rmtoll   ISR    RXBF    FL_SPI_IsActiveFlag_RXBuffFull
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_RXBuffFull(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_RXBF_Msk) == (SPI_ISR_RXBF_Msk));
}

/**
  * @brief    Get I2S RX Buffer Full Flag
  * @rmtoll   ISR    RXBF    FL_I2S_IsActiveFlag_RXBuffFull
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_RXBuffFull(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_RXBF_Msk) == (SPI_ISR_RXBF_Msk));
}


/**
  * @brief    Write SPI TX Buffer
  * @rmtoll   TXBUF        FL_SPI_WriteTXBuff
  * @param    SPIx SPI instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_WriteTXBuff(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->TXBUF, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Write I2S TX Buffer
  * @rmtoll   TXBUF        FL_I2S_WriteTXBuff
  * @param    SPIx SPI instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_WriteTXBuff(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->TXBUF, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Read SPI RX Buffer
  * @rmtoll   RXBUF        FL_SPI_ReadRXBuff
  * @param    SPIx SPI instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_SPI_ReadRXBuff(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->RXBUF, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Read I2S TX Buffer
  * @rmtoll   RXBUF        FL_I2S_ReadRXBuff
  * @param    SPIx SPI instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2S_ReadRXBuff(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->RXBUF, (0xffffffffU << 0U)) >> 0U);
}
/**
  * @brief    Set I2S Master RX CLK Output
  * @rmtoll   I2SCR    I2SRXOPT    FL_I2S_SetMasterRXCLKOutput
  * @param    SPIx SPI instance
  * @param    standard This parameter can be one of the following values:
  *           @arg @ref FL_I2S_MASTER_CLKOUTPUT_CONTINUOUS
  *           @arg @ref FL_I2S_MASTER_CLKOUTPUT_NOCONTINUOUS
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetMasterRXCLKOutput(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_I2SRXOPT_Msk, mode);
}

/**
  * @brief    Get I2S Master RX CLK Output
  * @rmtoll   I2SCR    I2SRXOPT    FL_I2S_GetMasterRXCLKOutput
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_MASTER_CLKOUTPUT_CONTINUOUS
  *           @arg @ref FL_I2S_MASTER_CLKOUTPUT_NOCONTINUOUS
  */
__STATIC_INLINE uint32_t FL_I2S_GetMasterRXCLKOutput(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_I2SRXOPT_Msk));
}

/**
  * @brief    Set I2S Standard
  * @rmtoll   I2SCR    I2SSTD    FL_I2S_SetStandardMode
  * @param    SPIx SPI instance
  * @param    standard This parameter can be one of the following values:
  *           @arg @ref FL_I2S_STANDARD_MODE_PHILIPS
  *           @arg @ref FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_PCM
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetStandardMode(SPI_Type *SPIx, uint32_t standard)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_I2SSTD_Msk, standard);
}

/**
  * @brief    Get I2S Standard
  * @rmtoll   I2SCR    I2SSTD    FL_I2S_GetStandardMode
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_STANDARD_MODE_PHILIPS
  *           @arg @ref FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_PCM
  */
__STATIC_INLINE uint32_t FL_I2S_GetStandardMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_I2SSTD_Msk));
}

/**
  * @brief    Set I2S Vocal Tract Length
  * @rmtoll   I2SCR    CHLEN    FL_I2S_SetVocalTractLength
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_16BITS
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_32BITS
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetVocalTractLength(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_CHLEN_Msk, length);
}

/**
  * @brief    Get I2S Vocal Tract Length
  * @rmtoll   I2SCR    CHLEN    FL_I2S_GetVocalTractLength
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_16BITS
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_32BITS
  */
__STATIC_INLINE uint32_t FL_I2S_GetVocalTractLength(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_CHLEN_Msk));
}

/**
  * @brief    Set I2S Idle Clock Polarity
  * @rmtoll   I2SCR    CKPOL    FL_I2S_SetIdleClockPolarity
  * @param    SPIx SPI instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_I2S_IDLE_POLARITY_LOW
  *           @arg @ref FL_I2S_IDLE_POLARITY_HIGHT
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetIdleClockPolarity(SPI_Type *SPIx, uint32_t polarity)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_CKPOL_Msk, polarity);
}

/**
  * @brief    Get I2S Idle Clock Polarity
  * @rmtoll   I2SCR    CKPOL    FL_I2S_GetIdleClockPolarity
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_IDLE_POLARITY_LOW
  *           @arg @ref FL_I2S_IDLE_POLARITY_HIGHT
  */
__STATIC_INLINE uint32_t FL_I2S_GetIdleClockPolarity(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_CKPOL_Msk));
}

/**
  * @brief    Set I2S Data Length
  * @rmtoll   I2SCR    DLEN    FL_I2S_SetDataLength
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_I2S_DATA_LENGTH_16BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_24BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_32BITS
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetDataLength(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_DLEN_Msk, length);
}

/**
  * @brief    Get I2S Data Length
  * @rmtoll   I2SCR    DLEN    FL_I2S_GetDataLength
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_DATA_LENGTH_16BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_24BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_32BITS
  */
__STATIC_INLINE uint32_t FL_I2S_GetDataLength(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_DLEN_Msk));
}

/**
  * @brief    Set I2S PCM Frame Synchronization
  * @rmtoll   I2SCR    PCMSYNC    FL_I2S_SetPCMFrameSynchronization
  * @param    SPIx SPI instance
  * @param    Synchronization This parameter can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_SHORT
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_LONG
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPCMFrameSynchronization(SPI_Type *SPIx, uint32_t Synchronization)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_PCMSYNC_Msk, Synchronization);
}

/**
  * @brief    Get II2S PCM Frame Synchronization
  * @rmtoll   I2SCR    PCMSYNC    FL_I2S_GetIPCMFrameSynchronization
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_SHORT
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_LONG
  */
__STATIC_INLINE uint32_t FL_I2S_GetIPCMFrameSynchronization(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_PCMSYNC_Msk));
}

/**
  * @brief    Set I2S Master Mode
  * @rmtoll   I2SCR    I2SMM    FL_I2S_SetTransferMode
  * @param    SPIx SPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2S_MODE_SLAVE_RX
  *           @arg @ref FL_I2S_MODE_SLAVE_TX
  *           @arg @ref FL_I2S_MODE_MASTER_RX
  *           @arg @ref FL_I2S_MODE_MASTER_TX
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetTransferMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_I2SMM_Msk, mode);
}

/**
  * @brief    Get I2S Data LengthMaster Mode
  * @rmtoll   I2SCR    I2SMM    FL_I2S_GetTransferMode
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_MODE_SLAVE_RX
  *           @arg @ref FL_I2S_MODE_SLAVE_TX
  *           @arg @ref FL_I2S_MODE_MASTER_RX
  *           @arg @ref FL_I2S_MODE_MASTER_TX
  */
__STATIC_INLINE uint32_t FL_I2S_GetTransferMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_I2SMM_Msk));
}

/**
  * @brief    Enable I2S Data Delay
  * @rmtoll   I2SCR    DLYEN    FL_I2S_EnableDataDelay
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableDataDelay(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SCR, SPI_I2SCR_DLYEN_Msk);
}

/**
  * @brief    Get I2S Data Delay Status
  * @rmtoll   I2SCR    DLYEN    FL_I2S_IsEnabledDataDelay
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledDataDelay(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_DLYEN_Msk) == SPI_I2SCR_DLYEN_Msk);
}

/**
  * @brief    Disable I2S Data Delay
  * @rmtoll   I2SCR    DLYEN    FL_I2S_DisableDataDelay
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableDataDelay(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SCR, SPI_I2SCR_DLYEN_Msk);
}

/**
  * @brief    Set PeripheralMode
  * @rmtoll   I2SCR    I2SMOD    FL_I2S_SetPeriphralMode
  * @param    SPIx SPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_SPI
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_I2S
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPeriphralMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->I2SCR, SPI_I2SCR_I2SMOD_Msk, mode);
}

/**
  * @brief    Get PeripheralMode
  * @rmtoll   I2SCR    I2SMOD    FL_I2S_GetPeriphralMode
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_SPI
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_I2S
  */
__STATIC_INLINE uint32_t FL_I2S_GetPeriphralMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_I2SMOD_Msk));
}

/**
  * @brief    Enable I2S
  * @rmtoll   I2SCR    I2SEN    FL_I2S_Enable
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_Enable(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SCR, SPI_I2SCR_I2SEN_Msk);
}

/**
  * @brief    Get I2S Enable Status
  * @rmtoll   I2SCR    I2SEN    FL_I2S_IsEnabled
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabled(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, SPI_I2SCR_I2SEN_Msk) == SPI_I2SCR_I2SEN_Msk);
}

/**
  * @brief    Disable I2S
  * @rmtoll   I2SCR    I2SEN    FL_I2S_Disable
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_Disable(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SCR, SPI_I2SCR_I2SEN_Msk);
}

/**
  * @brief    Enable I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_EnableMasterClockOutput
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableMasterClockOutput(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SPR, SPI_I2SPR_MCKOE_Msk);
}

/**
  * @brief    Get I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_IsEnabledMasterClockOutput
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledMasterClockOutput(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, SPI_I2SPR_MCKOE_Msk) == SPI_I2SPR_MCKOE_Msk);
}

/**
  * @brief    Disable I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_DisableMasterClockOutput
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableMasterClockOutput(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SPR, SPI_I2SPR_MCKOE_Msk);
}

/**
  * @brief    Set I2S BaudRate Prescale Fractional
  * @rmtoll   I2SPR    ODD    FL_I2S_SetPrescalerParity
  * @param    SPIx SPI instance
  * @param    prescalerParity This parameter can be one of the following values:
  *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
  *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPrescalerParity(SPI_Type *SPIx, uint32_t prescalerParity)
{
    MODIFY_REG(SPIx->I2SPR, SPI_I2SPR_ODD_Msk, prescalerParity);
}

/**
  * @brief    Get I2S BaudRate Prescale Fractiona
  * @rmtoll   I2SPR    ODD    FL_I2S_GetPrescalerParity
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
  *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE uint32_t FL_I2S_GetPrescalerParity(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, SPI_I2SPR_ODD_Msk));
}

/**
  * @brief    Write I2S BaudRate Prescale
  * @rmtoll   I2SPR    CLKDIV    FL_I2S_WritePrescalerLinear
  * @param    SPIx SPI instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_WritePrescalerLinear(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->I2SPR, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    Read I2S BaudRate Prescale
  * @rmtoll   I2SPR    CLKDIV    FL_I2S_ReadPrescalerLinear
  * @param    SPIx SPI instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2S_ReadPrescalerLinear(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, (0xffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup SPI_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
//FL_ErrorStatus FL_SPI_DeInit(SPI_Type *SPIx);
FL_ErrorStatus FL_SPI_Init(SPI_Type *SPIx, FL_SPI_InitTypeDef *initStruct);
void FL_SPI_StructInit(FL_SPI_InitTypeDef *initStruct);
FL_ErrorStatus FL_I2S_DeInit(SPI_Type *SPIx);
FL_ErrorStatus FL_I2S_Init(SPI_Type *SPIx, FL_I2S_InitTypeDef *initStruct);
void FL_I2S_StructInit(FL_I2S_InitTypeDef *initStruct);

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_SPI_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-18*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
